<p><strong>Analyse Data Set:</strong></p>
<p>Se tiene informaci&oacute;n de tres archivos en formato csv que servir&aacute;n como fuentes.<br />El primero de ellos es informaci&oacute;n de centros culturales de Madrid. Esta incluye datos del nombre,<br />c&oacute;digo, horario, equipamiento, transporte, descripci&oacute;n, accesibilidad, url, direcci&oacute;n<br />(v&iacute;a, clase vial, tipo de n&uacute;mero, calle, distrito, barrio, provincia, n&uacute;mero, planta, puerta, escaleras,<br />orientaci&oacute;n, localidad, coordenadas, latitud y longitud), tel&eacute;fono, fax, e-mail y tipo.</p>
<p>El segundo archivo es informaci&oacute;n de la agenda cultural de Madrid en los pr&oacute;ximos 100 d&iacute;as.<br />Incluye el ID, t&iacute;tulo, precio, si es gratuito o no, si es de larga duraci&oacute;n, d&iacute;as a la semana, d&iacute;as excluidos,<br />fecha, fecha fin, hora, descripci&oacute;n, url, actividad, url de las actividades, instalaci&oacute;n, url de instalaci&oacute;n,<br />ubicaci&oacute;n del envento (coordenadas, distrito, latitud y longitud), y tipo.</p>
<p>Adem&aacute;s, tambi&eacute;n se cuenta con direcciones generales vigentes de Madrid actualizados en 2015. Incluye informaci&oacute;n de las v&iacute;as,<br />n&uacute;mero, calificador, tipo, distrito, barrio, c&oacute;digo postal, coordenadas, latitud, longitud, &aacute;ngulo de rotulaci&oacute;n, etc.</p>
<p>Se ha observado que existe informaci&oacute;n que son primarias en estos documentos como los c&oacute;digos, nombres, coordenadas, latitud,<br />longitud, url, descripci&oacute;n de eventos, etc. Es decir, que siempre se tiene estos campos con informaci&oacute;n para cada dato. Sin embargo,<br />existen otros atributos que no siempre se muestran; por ejemplo, si un evento es gratuito o no, la orientaci&oacute;n de una direcci&oacute;n,<br />puerta, escaleras, etc. Asimismo, se ha notado que estos campos que a veces est&aacute;n incompletos no son tan importantes para nuestro proyecto.<br />Por ello, se usar&aacute;n solo campos que tengan datos.</p>
<p>En general, se tiene informaci&oacute;n que puede relacionarse entre s&iacute;, lo que ayudar&aacute; a buscar los eventos culturales en una zona, teniendo datos<br />que pueden ser atributos relacionales; como la direcci&oacute;n, sobre todo la longitud, latitud, y coordenadas X e Y. Los otros campos se usar&aacute;n<br />para complementar informaci&oacute;n de los eventos culturales como la descripci&oacute;n, nombre, urls, etc.</p>
<p>Por otro lado, se ha notado que para encontrar un evento cercano a un lugar espec&iacute;fico como una casa, se tendr&aacute; que buscar coordenadas de los<br />eventos cercanos mediante una comparaci&oacute;n de distancias usando principalmente las coordenadas de la ubicaci&oacute;n de ambas localidades.</p>
<p><strong>Analyse Licesing of the Data Source:</strong></p>
<p>El editor y titular de la licencia es el Ayuntamiento de Madrid. Actualizada a 2014.</p>
<p>Los derechos de uso de la licencia incluyen la utilizaci&oacute;n de la informaci&oacute;n para cualquier actividad que no constituya una actividad administrativa p&uacute;blica.<br />"Por ejemplo, la reutilizaci&oacute;n autorizada incluye actividades como la copia, difusi&oacute;n, modificaci&oacute;n, adaptaci&oacute;n, extracci&oacute;n, reordenaci&oacute;n y combinaci&oacute;n de la informaci&oacute;n."<br />En cualquier caso se ha de citar la fuente del documento que se vaya a reutilizar, as&iacute; como la fecha de &uacute;ltima actualizaci&oacute;n de los datos utilizados.<br />Del mismo modo no se puede incluir al ayuntamiento de Madrid como part&iacute;cipe o patrocinador de la reutilizaci&oacute;n de los datos que se lleve a cabo.</p>
<p>Se puede encontrar m&aacute;s informaci&oacute;n en el link<br />http://datos.madrid.es/portal/site/egob/menuitem.619dfa2990e56405bb8d69f6ecd08a0c/?vgnextoid=b4c412b9ace9f310VgnVCM100000171f5a0aRCRD</p>
<p><br /><strong>Resource naming strategy:</strong></p>
<p>Hemos decidido que el dominio para nuestra aplicaci&oacute;n ser&aacute; www.linkedculture.org, y que la URI de cada recurso ser&aacute; del tipo<br />http://www.linkedculture.org/ontologies/tipoderecurso/recurso<br />por ejemplo:<br />http://www.linkedculture.org/ontologies/direcciones/dir1</p>
<p>Si solamente quisieramos acceder a una parte del recurso har&iacute;amos uso de una almohadilla. Por ejemplo, si quisieramos comprobar el campo "tipo"<br />en una direcci&oacute;n, lo har&iacute;amos de la siguiente forma:</p>
<p>http://www.linkedculture.org/ontologies/direcciones/dir1#tipo</p>
<p>Con respecto a la negociaci&oacute;n del contenido, hemos decidido emplear la resoluci&oacute;n transparente en la que en caso de haber datos en el cach&eacute;,<br />el agente del usuario no tiene que emplear tiempo en decidir la mejor forma de que el contenido sea representado.</p>