<p><h1>Analyse Data Set:</h1></p>

<p>Se tiene informaci&oacute;n de dos archivos en formato csv que servir&aacute;n como fuentes. Uno de ellos contiene informaci&oacute;n de centros culturales de Madrid. Esta incluye datos del nombre, c&oacute;digo, horario, equipamiento, transporte, descripci&oacute;n, accesibilidad, url, direcci&oacute;n (v&iacute;a, clase vial, tipo de n&uacute;mero, calle, distrito, barrio, provincia, n&uacute;mero, planta, puerta, escaleras, orientaci&oacute;n, localidad, coordenadas, latitud y longitud), tel&eacute;fono, fax, e-mail y tipo.</p>

<p>El segundo archivo contiene informaci&oacute;n de la agenda cultural de Madrid en los pr&oacute;ximos 100 d&iacute;as. Incluye el ID, t&iacute;tulo, precio, si es gratuito o no, si es de larga duraci&oacute;n, d&iacute;as a la semana, d&iacute;as excluidos, fecha, fecha fin, hora, descripci&oacute;n, url, actividad, url de las actividades, instalaci&oacute;n, url de instalaci&oacute;n, ubicaci&oacute;n del envento (coordenadas, distrito, latitud y longitud), y tipo.</p>

<p>Se ha observado que existe informaci&oacute;n que son primarias en estos documentos como los c&oacute;digos, nombres, coordenadas, latitud, longitud, url, descripci&oacute;n de eventos, etc. Es decir, que siempre se tiene estos campos con informaci&oacute;n para cada dato. Sin embargo, existen otros atributos que no siempre se muestran; por ejemplo, si un evento es gratuito o no, puerta, escaleras, etc. Asimismo, se ha notado que estos campos que a veces est&aacute;n incompletos no son tan importantes para nuestro proyecto. Por ello, se usar&aacute;n solo campos que tengan datos.</p>

<p>En general, se tiene informaci&oacute;n que puede relacionarse entre s&iacute;, lo que ayudar&aacute; a buscar los eventos culturales en un determinado centro cultural, teniendo datos que pueden ser atributos relacionales; como la direcci&oacute;n de un centro y la direcci&oacute;n de un evento o de manera m&aacute;s precisa las coordenadas en el mapa de ambos. Otros campos se usar&aacute;n para complementar informaci&oacute;n de los eventos culturales como la descripci&oacute;n, nombre, urls, etc.</p>

<p>De este modo, al consultar la informaci&oacute;n de un evento cultural podremos r&aacute;pidamente enlazar esta con la del centro cultural donde se celebra, para poder as&iacute; conocer datos como  la direcci&oacute;n del mismo o el tel&eacute;fono y email de contacto.</p>

<p><h1>Analyse Licesing of the Data Source:</h1></p>

<p>El editor y titular de la licencia es el Ayuntamiento de Madrid. Actualizada a 2014.</p>

<p>Los derechos de uso de la licencia incluyen la utilizaci&oacute;n de la informaci&oacute;n para cualquier actividad que no constituya una actividad administrativa p&uacute;blica. &quot;Por ejemplo, la reutilizaci&oacute;n autorizada incluye actividades como la copia, difusi&oacute;n, modificaci&oacute;n, adaptaci&oacute;n, extracci&oacute;n, reordenaci&oacute;n y combinaci&oacute;n de la informaci&oacute;n.&quot; En cualquier caso se ha de citar la fuente del documento que se vaya a reutilizar, as&iacute; como la fecha de &uacute;ltima actualizaci&oacute;n de los datos utilizados. Del mismo modo no se puede incluir al ayuntamiento de Madrid como part&iacute;cipe o patrocinador de la reutilizaci&oacute;n de los datos que se lleve a cabo.</p>

<p>Se puede encontrar m&aacute;s informaci&oacute;n en el link http://datos.madrid.es/portal/site/egob/menuitem.619dfa2990e56405bb8d69f6ecd08a0c/?vgnextoid=b4c412b9ace9f310VgnVCM100000171f5a0aRCRD</p>

<p><h1> Resource naming strategy:</h1></p>

<p>Hemos decidido que el dominio para nuestra aplicaci&oacute;n ser&aacute; www.linkedculture.org, y que la URI de cada recurso ser&aacute; del tipo http://www.linkedculture.org/ontologies/tipoderecurso/recurso por ejemplo: http://www.linkedculture.org/ontologies/centros/centro1</p>

<p>Si solamente quisieramos acceder a una parte del recurso har&iacute;amos uso de una almohadilla. Por ejemplo, si quisieramos comprobar el campo &quot;email&quot; en una direcci&oacute;n, lo har&iacute;amos de la siguiente forma:</p>

<p>http://www.linkedculture.org/ontologies/centros/centro1#email</p>

<p>NOTA: Debido a un fallo en trabajando con la herramienta LODRefine, y tras haberlo hablado con el profesor Ra&uacute;l Castro, hemos decidido que lo mejor es poner todos los recursos tras la URI base:</p>

<p>http://www.linkedculture.org/ontologies/resources/</p>

<p>por ejemplo: http://www.linkedculture.org/ontologies/resources/centro1 http://www.linkedculture.org/ontologies/resources/evento1</p>

<p>Con respecto a la negociaci&oacute;n del contenido, hemos decidido emplear la resoluci&oacute;n transparente en la que en caso de haber datos en el cach&eacute;, el agente del usuario no tiene que emplear tiempo en decidir la mejor forma de que el contenido sea representado.</p>